#creat with :PyCharm
#Author:Wilson
#Date:2018/5/3
#Time:15:19

menu = {
        "直辖市":{
                "北京市":["东城区","西城区","崇文区","宣武区","朝阳区","海淀区","丰台区",
                       "石景山区","门头沟区","房山区","通州区","顺义区","昌平区","大兴区",
                       "怀柔区","平谷区","延庆县","密云县",],
                "上海市":{
                    "黄埔区":{"黄河路","人民广场","南京路",},
                    "静安区":{"静安寺","北京西路",},
                    "虹口区":{"大连路":{},"飞虹路":{},"公平路":{},},
                    "杨浦区":{"控江路","周家嘴路","军工路",},
                },
        },
        "浙江省":{
            "杭州市":["拱墅区","上城区","下城区","江干区","西湖区","滨江区","萧山区","余杭区","建德市","富阳市",
                   "临安市","桐庐县","淳安县"],
            "宁波市":["海曙区","江东区","江北区","北仑区","镇海区","鄞州区","余姚市","慈溪市","奉化市","象山县",
                   "宁海县"],
            "温州市":["鹿城区","龙湾区","瓯海区","瑞安市","乐清市","洞头县","永嘉县","平阳县","苍南县","文成县",
                   "泰顺县"],
            "嘉兴市":["南湖区","秀洲区","海宁市","平湖市","桐乡市","嘉善县","海盐县"],
            "湖州市":["吴兴区","南浔区","德清县","长兴县","安吉县"],
            "绍兴市":["越城区","诸暨市","上虞市","嵊州市","绍兴县","新昌县"],
            "金华市":["婺城区","金东区","兰溪市","义乌市","东阳市","永康市","武义县","浦江县","磐安县"],
        },
}

current_layer = menu
parent_layer = menu

while True:
    for x,y in enumerate(current_layer):    #定义x，y两个参数，接受数字和值
        print(x,y)
    choice = input("请输入地区的序号:  返回上一层q>>").strip()
    if len(choice) == 0: continue  #此处continue 只有一行，可以跟着上一行，可使程序更优美
    if choice in current_layer:
        parent_layer = current_layer  #当前层为父层
        current_layer = current_layer[choice] #改成了子层
    elif choice == "q":
        current_layer = parent_layer #退出时当前层=父层，就退到上层
    else:
        print("无此项，请重新输入>>")