#creat with :PyCharm
#Author:Wilson
#Date:2018/5/12
#Time:15:53

# 目前没有完成 enumerate（）引用位置有问题 2018年5月13日
# 已经完成应用，下级菜单使用正常，但是按q只能回退一级，无法持续回退  2018年5月15日 14:41:51 星期二
# 加入按x直接退到开始； 加入当选择到底层时，不报错，而直接退出（try...except...） 2018年5月16日 11:35:38 星期三

menu = {
        "直辖市":{
                "北京市":["东城区","西城区","崇文区","宣武区","朝阳区","海淀区","丰台区",
                       "石景山区","门头沟区","房山区","通州区","顺义区","昌平区","大兴区",
                       "怀柔区","平谷区","延庆县","密云县",],
                "上海市":{
                    "黄埔区":{"黄河路","人民广场","南京路",},
                    "静安区":{"静安寺","北京西路",},
                    "虹口区":{"大连路":{},"飞虹路":{},"公平路":{},},
                    "杨浦区":{"控江路","周家嘴路","军工路",},
                },
        },
        "浙江省":{
            "杭州市":["拱墅区","上城区","下城区","江干区","西湖区","滨江区","萧山区","余杭区","建德市","富阳市",
                   "临安市","桐庐县","淳安县"],
            "宁波市":["海曙区","江东区","江北区","北仑区","镇海区","鄞州区","余姚市","慈溪市","奉化市","象山县",
                   "宁海县"],
            "温州市":["鹿城区","龙湾区","瓯海区","瑞安市","乐清市","洞头县","永嘉县","平阳县","苍南县","文成县",
                   "泰顺县"],
            "嘉兴市":["南湖区","秀洲区","海宁市","平湖市","桐乡市","嘉善县","海盐县"],
            "湖州市":["吴兴区","南浔区","德清县","长兴县","安吉县"],
            "绍兴市":["越城区","诸暨市","上虞市","嵊州市","绍兴县","新昌县"],
            "金华市":["婺城区","金东区","兰溪市","义乌市","东阳市","永康市","武义县","浦江县","磐安县"],
        },
        "江苏省":{
            "苏州市": {"黄埔区":{"黄河路","人民广场","南京路",},
                    "静安区":{"静安寺","北京西路",},
                    "虹口区":{"大连路":{},"飞虹路":{},"公平路":{},},
                    "杨浦区":{"控江路","周家嘴路","军工路",},},
            "无锡市": {"黄埔区":{"黄河路", "人民广场","南京路",},
                     "静安区": {"静安寺", "北京西路", },
                    "虹口区":{"大连路":{},"飞虹路":{},"公平路":{},},
                    "杨浦区":{"控江路","周家嘴路","军工路",},},
            "常州市": {"黄埔区":{"黄河路","人民广场","南京路",},
                    "静安区":{"静安寺","北京西路",},
                    "虹口区":{"大连路":{},"飞虹路":{},"公平路":{},},
                    "杨浦区":{"控江路","周家嘴路","军工路",},},
            "镇江市": {"黄埔区":{"黄河路","人民广场","南京路",},
                    "静安区":{"静安寺","北京西路",},
                    "虹口区":{"大连路":{},"飞虹路":{},"公平路":{},},
                    "杨浦区":{"控江路","周家嘴路","军工路",},},
        }
}

current_dict = menu
parent_dict = []

while True:
    # 循环取出current_dict的值
    for x, y in enumerate(current_dict):  # 定义x，y两个参数，接受数字和值
        print(x, y)
    print("".center(50,'_'))
    print("请输入你选择的地区序号")
    choice = input("重新选择按'x',返回上一层按'q':>>").strip()

    if choice.isdigit():
        choice=int(choice)
        try:
            if 0 <= choice <len(current_dict):
                # ---------将客户选择的信息存入新的city_list字典中----------
                city_list = list(current_dict.keys())    # 此处注意要使用 .keys()才能拿到序号

                parent_dict.append(current_dict)
                current_dict = current_dict[city_list[choice]]      # 这里就是引用

                print(''.center(50, '-'))
            else:
                print("Error ：该序号内没有项目，请重新输入范围内的序号>>>")
        except:
            print("warning: 已经到底层，请重新选择")
            current_dict = menu       # 到最底层后，返回最开始

    elif choice == "q":
        if parent_dict:
            current_dict = parent_dict.pop()    # 返回：当前层=父层，就退到上层

    elif choice == "x":
        current_dict = menu  # 退出时当前层=父层，就退到上层

    else:
        print("无此项，请重新输入>>")

